##### 1. System

In [ ]:
# mysql 명령어 리스트를 확인
mysql> help

In [ ]:
# 현재상태보기
mysql> status

In [ ]:
# mysql 접속 종료
mysql> exit
mysql> quit

##### 2. Database

In [ ]:
# DB 목록 보기
mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sys                |
| test               |
| world              |
+--------------------+
6 rows in set (0.00 sec)

In [ ]:
# DB 만들기
mysql> create database JSW;
mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| JSW                |
| mysql              |
| performance_schema |
| sys                |
| test               |
| world              |
+--------------------+
7 rows in set (0.01 sec)

In [ ]:
# DB 접속하기
mysql> use test;
Database changed

In [ ]:
# 현재 접속중인 DB 확인하기
mysql> select database();
+------------+
| database() |
+------------+
| JSW        |
+------------+
1 row in set (0.00 sec)

In [ ]:
# DB 지우기
mysql> drop database test;
Query OK, 0 rows affected (0.00 sec)

In [ ]:
mysql> show databases: # DB삭제된 것 확인하기
    +--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sys                |
| test               |
| world              |
+--------------------+
6 rows in set (0.00 sec)

##### 3. Table

In [ ]:
# 테이블 만들기
# 문자열 name 20자, age 숫자 3자 칼럼 있는 테이블 생성
mysql> create table user (name char(20), age int(3));
Query OK, 0 rows affected (0.01 sec)

mysql> show tables;
+----------------+
| Tables_in_test |
+----------------+
| user           |
| user1          |
| user2          |
+----------------+
3 rows in set (0.00 sec)

In [ ]:
# 테이블 목록 확인
mysql> show tables;
+----------------+
| Tables_in_test |
+----------------+
| user           |
| user1          |
| user2          |
+----------------+
3 rows in set (0.00 sec)

In [ ]:
# 테이블 구조 확인
mysql> desc user;
mysql> describe user;
mysql> explain user;
+-------+----------+------+-----+---------+-------+
| Field | Type     | Null | Key | Default | Extra |
+-------+----------+------+-----+---------+-------+
| name  | char(20) | YES  |     | NULL    |       |
| age   | int(3)   | YES  |     | NULL    |       |
+-------+----------+------+-----+---------+-------+
2 rows in set (0.00 sec)

In [ ]:
# 테이블 이름 바꾸기
mysql> rename table user to dss;
Query OK, 0 rows affected (0.01 sec)

In [ ]:
mysql> show tables; # 테이블 이름 바뀐것 확인
+----------------+
| Tables_in_test |
+----------------+
| dss            |
| user1          |
| user2          |
+----------------+
3 rows in set (0.00 sec)

In [ ]:
# 테이블에 데이터 추가하기
mysql> insert into dss(name, age) values("alice", 23);
Query OK, 1 row affected (0.00 sec)
mysql> insert into dss(name, age) values("Aaron", 31);
Query OK, 1 row affected (0.00 sec)

In [ ]:
# 추가된 데이터 확인하기
mysql> select * from dss;
+-------+------+
| name  | age  |
+-------+------+
| alice |   23 |
| Aaron |   31 |
+-------+------+
2 rows in set (0.00 sec)

In [ ]:
mysql> select name from dss; # 테이블에서 특정 컬럼만 확인하기
+-------+
| name  |
+-------+
| alice |
| Aaron |
+-------+
2 rows in set (0.00 sec)

In [ ]:
# 테이블 지우기
mysql> drop table dss;
Query OK, 0 rows affected (0.00 sec)

In [ ]:
mysql> show tables; # 테이블 삭제된것 확인
+----------------+
| Tables_in_test |
+----------------+
| user1          |
| user2          |
+----------------+
2 rows in set (0.00 sec)

##### 실습

In [ ]:
# city_info 데이터베이스 만들기
mysql> create database city_info;
Query OK, 1 row affected (0.00 sec)

In [ ]:
# city_info 데이터베이스 안에 popular 테이블 만들기
mysql> create table popular (rank int(4), city_name char(20), popular int(10));
Query OK, 0 rows affected (0.01 sec)

In [ ]:
# popular 테이블 구조 확인
mysql> desc popular;
+-----------+----------+------+-----+---------+-------+
| Field     | Type     | Null | Key | Default | Extra |
+-----------+----------+------+-----+---------+-------+
| rank      | int(4)   | YES  |     | NULL    |       |
| city_name | char(20) | YES  |     | NULL    |       |
| popular   | int(10)  | YES  |     | NULL    |       |
+-----------+----------+------+-----+---------+-------+
3 rows in set (0.00 sec)

In [ ]:
# popular 테이블에 5개 도시 정보 입력
mysql> insert into popular (rank, city_name, popular) values (1, "seoul", 9904312);
Query OK, 1 row affected (0.01 sec)
mysql> insert into popular (rank, city_name, popular) values (2, "busan", 3448737);
Query OK, 1 row affected (0.00 sec)
mysql> insert into popular (rank, city_name, popular) values (3, "incheon", 2890451);
Query OK, 1 row affected (0.00 sec)
mysql> insert into popular (rank, city_name, popular) values (4, "daegu", 2466052);
Query OK, 1 row affected (0.01 sec)
mysql> insert into popular (rank, city_name, popular) values (5, "daejeon", 1538394);
Query OK, 1 row affected (0.00 sec)

In [ ]:
# popular 테이블에 입력한 내용 확인
mysql> select * from popular;
+------+-----------+---------+
| rank | city_name | popular |
+------+-----------+---------+
|    1 | seoul     | 9904312 |
|    2 | busan     | 3448737 |
|    3 | incheon   | 2890451 |
|    4 | daegu     | 2466052 |
|    5 | daejeon   | 1538394 |
+------+-----------+---------+
5 rows in set (0.00 sec)